# PostEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostEventArgs Class
Members See Also
---
The class is used as a base class for arguments of any post-event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PostEventArgs : RevitEventArgs
```

Visual Basic
---
```text
Public Class PostEventArgs _
	Inherits RevitEventArgs
```

Visual C++
---
```text
public ref class PostEventArgs : public RevitEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitEventArgs Autodesk.Revit.DB.Events..::..PostEventArgs Autodesk.Revit.DB.Events..::..PostDocEventArgs
# See Also
PostEventArgs Members
Autodesk.Revit.DB.Events Namespace